# coding: utf-8


module ZenithalMathCreaterConstant

  CREATION_METHODS = {
    "n" => :custom_number, "i" => :custom_identifier, "op" => :custom_identifier, "o" => :custom_operator,
    "sp" => :superscript, "sb" => :superscript,
    "frac" => :fraction,
    "sqrt" => :radical
  }
  LEAF_ELEMENTS = [
    "n", "i", "op", "o", "text"
  ]
  REPLACEMENTS = {
    "-" => "−",
    "*" => "∗"
  }

  PAREN_SYMBOLS = {
    "p" => {
      0 => ["(", ")"],
      1 => ["&#xF0039;", "&#xF0045;"], 2 => ["&#xF003A;", "&#xF0046;"], 3 => ["&#xF003B;", "&#xF0047;"], 4 => ["&#xF003C;", "&#xF0048;"],
      5 => ["&#xF003D;", "&#xF0049;"], 6 => ["&#xF003E;", "&#xF004A;"], 7 => ["&#xF003F;", "&#xF004B;"], 8 => ["&#xF0040;", "&#xF004C;"],
      9 => ["&#xF0041;", "&#xF004D;"], 10 => ["&#xF0042;", "&#xF004E;"], 11 => ["&#xF0043;", "&#xF004F;"], 12 => ["&#xF0044;", "&#xF0050;"]
    },
    "b" => {
      0 => ["[", "]"]
    },
    "c" => {
      0 => ["{", "}"],
      1 => ["&#xF0069;", "&#xF0075;"], 2 => ["&#xF006A;", "&#xF0076;"], 3 => ["&#xF006B;", "&#xF0077;"], 4 => ["&#xF006C;", "&#xF0078;"],
      5 => ["&#xF006D;", "&#xF0079;"], 6 => ["&#xF006E;", "&#xF007A;"], 7 => ["&#xF006F;", "&#xF007B;"], 8 => ["&#xF0070;", "&#xF007C;"],
      9 => ["&#xF0071;", "&#xF007D;"], 10 => ["&#xF0072;", "&#xF007E;"], 11 => ["&#xF0073;", "&#xF007F;"], 12 => ["&#xF0074;", "&#xF0080;"]
    },
    "v" => {
      0 => ["|", "|"]
    },
    "vv" => {
      0 => ["||", "||"]
    },
    "f" => {
      0 => ["⌊", "⌋"]
    },
    "g" => {
      0 => ["⌈", "⌉"]
    },
    "a" => {
      0 => ["⟨", "⟩"]
    },
    "aa" => {
      0 => ["⟪", "⟫"]
    }
  }
  INTEGRAL_SYMBOLS = {
    "int" => "\u222B",
    "oint" => "\u222E"
  }
  RADICAL_SYMBOLS = {
    0 => "√", 1 => "&#xF011D;", 2 => "&#xF011E;", 3 => "&#xF011F;"
  }

  FUNCTIONS = [
    "sin", "cos", "tan", "cot", "sec", "csc", "sinh", "cosh", "tanh",
    "log", "ln", "lg", "exp",
    "inf", "sup", "min", "max",
    "ker", "im",
    "lim", "colim",
    "deg", "dim", "det", "sgn", "arg"
  ]

  OPERATORS = {
    "plus" => ["+", :bin], 
    "minus" => ["−", :bin],
    "pm" => ["±", :bin],
    "mp" => ["∓", :bin],
    "times" => ["×", :bin],
    "div" => ["÷", :bin],
    "ast" => ["∗", :bin],
    "eq" => ["=", :rel],
    "coloneqq" => [":=", :rel],
    "eqqcolon" => ["=:", :rel],
    "comma" => [",", :del],
    "colon" => [":", :del],
    "semicolon" => [";", :del],
    "cdots" => ["⋯", :ord]
  }

  GREEKS = {
    "a" => "α", "b" => "β", "c" => "ψ", "d" => "δ", "e" => "ε", "f" => "φ", "g" => "γ", "h" => "η", "i" => "ι", "j" => "ξ", "k" => "κ", "l" => "λ", "m" => "μ", 
    "n" => "ν", "o" => "ο", "p" => "π", "q" => "ϕ", "r" => "ρ", "s" => "σ", "t" => "τ", "u" => "θ", "v" => "ω", "w" => "ς", "x" => "χ", "y" => "υ", "z" => "ζ",
    "A" => "Α", "B" => "Β", "C" => "Ψ", "D" => "Δ", "E" => "Ε", "F" => "Φ", "G" => "Γ", "H" => "Η", "I" => "Ι", "J" => "Ξ", "K" => "Κ", "L" => "Λ", "M" => "Μ", 
    "N" => "Ν", "O" => "Ο", "P" => "Π", "Q" => "Φ", "R" => "Ρ", "S" => "Σ", "T" => "Τ", "U" => "Θ", "V" => "Ω", "W" => "Σ", "X" => "Χ", "Y" => "Υ", "Z" => "Ζ"
  }

end